espressif/esp-idf/components/soc/esp32p4/include/soc/lp_aonclkrst_reg.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_AONCLKRST_LP_CLK_CONF_REG register
 *  need_des
 */
#define LP_AONCLKRST_LP_CLK_CONF_REG (DR_REG_LP_AONCLKRST_BASE + 0x0)
/** LP_AONCLKRST_SLOW_CLK_SEL : R/W; bitpos: [1:0]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_SLOW_CLK_SEL    0x00000003U
#define LP_AONCLKRST_SLOW_CLK_SEL_M  (LP_AONCLKRST_SLOW_CLK_SEL_V << LP_AONCLKRST_SLOW_CLK_SEL_S)
#define LP_AONCLKRST_SLOW_CLK_SEL_V  0x00000003U
#define LP_AONCLKRST_SLOW_CLK_SEL_S  0
/** LP_AONCLKRST_FAST_CLK_SEL : R/W; bitpos: [3:2]; default: 1;
 *  need_des
 */
#define LP_AONCLKRST_FAST_CLK_SEL    0x00000003U
#define LP_AONCLKRST_FAST_CLK_SEL_M  (LP_AONCLKRST_FAST_CLK_SEL_V << LP_AONCLKRST_FAST_CLK_SEL_S)
#define LP_AONCLKRST_FAST_CLK_SEL_V  0x00000003U
#define LP_AONCLKRST_FAST_CLK_SEL_S  2
/** LP_AONCLKRST_LP_PERI_DIV_NUM : R/W; bitpos: [9:4]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LP_PERI_DIV_NUM    0x0000003FU
#define LP_AONCLKRST_LP_PERI_DIV_NUM_M  (LP_AONCLKRST_LP_PERI_DIV_NUM_V << LP_AONCLKRST_LP_PERI_DIV_NUM_S)
#define LP_AONCLKRST_LP_PERI_DIV_NUM_V  0x0000003FU
#define LP_AONCLKRST_LP_PERI_DIV_NUM_S  4
/** LP_AONCLKRST_ANA_SEL_REF_PLL8M : R/W; bitpos: [10]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_ANA_SEL_REF_PLL8M    (BIT(10))
#define LP_AONCLKRST_ANA_SEL_REF_PLL8M_M  (LP_AONCLKRST_ANA_SEL_REF_PLL8M_V << LP_AONCLKRST_ANA_SEL_REF_PLL8M_S)
#define LP_AONCLKRST_ANA_SEL_REF_PLL8M_V  0x00000001U
#define LP_AONCLKRST_ANA_SEL_REF_PLL8M_S  10

/** LP_AONCLKRST_LP_CLK_PO_EN_REG register
 *  need_des
 */
#define LP_AONCLKRST_LP_CLK_PO_EN_REG (DR_REG_LP_AONCLKRST_BASE + 0x4)
/** LP_AONCLKRST_CLK_CORE_EFUSE_OEN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_CORE_EFUSE_OEN    (BIT(0))
#define LP_AONCLKRST_CLK_CORE_EFUSE_OEN_M  (LP_AONCLKRST_CLK_CORE_EFUSE_OEN_V << LP_AONCLKRST_CLK_CORE_EFUSE_OEN_S)
#define LP_AONCLKRST_CLK_CORE_EFUSE_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_CORE_EFUSE_OEN_S  0
/** LP_AONCLKRST_CLK_LP_BUS_OEN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_LP_BUS_OEN    (BIT(1))
#define LP_AONCLKRST_CLK_LP_BUS_OEN_M  (LP_AONCLKRST_CLK_LP_BUS_OEN_V << LP_AONCLKRST_CLK_LP_BUS_OEN_S)
#define LP_AONCLKRST_CLK_LP_BUS_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_LP_BUS_OEN_S  1
/** LP_AONCLKRST_CLK_AON_SLOW_OEN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_AON_SLOW_OEN    (BIT(2))
#define LP_AONCLKRST_CLK_AON_SLOW_OEN_M  (LP_AONCLKRST_CLK_AON_SLOW_OEN_V << LP_AONCLKRST_CLK_AON_SLOW_OEN_S)
#define LP_AONCLKRST_CLK_AON_SLOW_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_AON_SLOW_OEN_S  2
/** LP_AONCLKRST_CLK_AON_FAST_OEN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_AON_FAST_OEN    (BIT(3))
#define LP_AONCLKRST_CLK_AON_FAST_OEN_M  (LP_AONCLKRST_CLK_AON_FAST_OEN_V << LP_AONCLKRST_CLK_AON_FAST_OEN_S)
#define LP_AONCLKRST_CLK_AON_FAST_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_AON_FAST_OEN_S  3
/** LP_AONCLKRST_CLK_SLOW_OEN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_SLOW_OEN    (BIT(4))
#define LP_AONCLKRST_CLK_SLOW_OEN_M  (LP_AONCLKRST_CLK_SLOW_OEN_V << LP_AONCLKRST_CLK_SLOW_OEN_S)
#define LP_AONCLKRST_CLK_SLOW_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_SLOW_OEN_S  4
/** LP_AONCLKRST_CLK_FAST_OEN : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_FAST_OEN    (BIT(5))
#define LP_AONCLKRST_CLK_FAST_OEN_M  (LP_AONCLKRST_CLK_FAST_OEN_V << LP_AONCLKRST_CLK_FAST_OEN_S)
#define LP_AONCLKRST_CLK_FAST_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_FAST_OEN_S  5
/** LP_AONCLKRST_CLK_FOSC_OEN : R/W; bitpos: [6]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_FOSC_OEN    (BIT(6))
#define LP_AONCLKRST_CLK_FOSC_OEN_M  (LP_AONCLKRST_CLK_FOSC_OEN_V << LP_AONCLKRST_CLK_FOSC_OEN_S)
#define LP_AONCLKRST_CLK_FOSC_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_FOSC_OEN_S  6
/** LP_AONCLKRST_CLK_RC32K_OEN : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_RC32K_OEN    (BIT(7))
#define LP_AONCLKRST_CLK_RC32K_OEN_M  (LP_AONCLKRST_CLK_RC32K_OEN_V << LP_AONCLKRST_CLK_RC32K_OEN_S)
#define LP_AONCLKRST_CLK_RC32K_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_RC32K_OEN_S  7
/** LP_AONCLKRST_CLK_SXTAL_OEN : R/W; bitpos: [8]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_SXTAL_OEN    (BIT(8))
#define LP_AONCLKRST_CLK_SXTAL_OEN_M  (LP_AONCLKRST_CLK_SXTAL_OEN_V << LP_AONCLKRST_CLK_SXTAL_OEN_S)
#define LP_AONCLKRST_CLK_SXTAL_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_SXTAL_OEN_S  8
/** LP_AONCLKRST_CLK_SOSC_OEN : R/W; bitpos: [9]; default: 0;
 *  1'b1: probe sosc clk on
 *  1'b0: probe sosc clk off
 */
#define LP_AONCLKRST_CLK_SOSC_OEN    (BIT(9))
#define LP_AONCLKRST_CLK_SOSC_OEN_M  (LP_AONCLKRST_CLK_SOSC_OEN_V << LP_AONCLKRST_CLK_SOSC_OEN_S)
#define LP_AONCLKRST_CLK_SOSC_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_SOSC_OEN_S  9

/** LP_AONCLKRST_LP_CLK_EN_REG register
 *  need_des
 */
#define LP_AONCLKRST_LP_CLK_EN_REG (DR_REG_LP_AONCLKRST_BASE + 0x8)
/** LP_AONCLKRST_LP_RTC_XTAL_FORCE_ON : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LP_RTC_XTAL_FORCE_ON    (BIT(26))
#define LP_AONCLKRST_LP_RTC_XTAL_FORCE_ON_M  (LP_AONCLKRST_LP_RTC_XTAL_FORCE_ON_V << LP_AONCLKRST_LP_RTC_XTAL_FORCE_ON_S)
#define LP_AONCLKRST_LP_RTC_XTAL_FORCE_ON_V  0x00000001U
#define LP_AONCLKRST_LP_RTC_XTAL_FORCE_ON_S  26
/** LP_AONCLKRST_CK_EN_LP_RAM : R/W; bitpos: [27]; default: 1;
 *  need_des
 */
#define LP_AONCLKRST_CK_EN_LP_RAM    (BIT(27))
#define LP_AONCLKRST_CK_EN_LP_RAM_M  (LP_AONCLKRST_CK_EN_LP_RAM_V << LP_AONCLKRST_CK_EN_LP_RAM_S)
#define LP_AONCLKRST_CK_EN_LP_RAM_V  0x00000001U
#define LP_AONCLKRST_CK_EN_LP_RAM_S  27
/** LP_AONCLKRST_ETM_EVENT_TICK_EN : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_ETM_EVENT_TICK_EN    (BIT(28))
#define LP_AONCLKRST_ETM_EVENT_TICK_EN_M  (LP_AONCLKRST_ETM_EVENT_TICK_EN_V << LP_AONCLKRST_ETM_EVENT_TICK_EN_S)
#define LP_AONCLKRST_ETM_EVENT_TICK_EN_V  0x00000001U
#define LP_AONCLKRST_ETM_EVENT_TICK_EN_S  28
/** LP_AONCLKRST_PLL8M_CLK_FORCE_ON : R/W; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_PLL8M_CLK_FORCE_ON    (BIT(29))
#define LP_AONCLKRST_PLL8M_CLK_FORCE_ON_M  (LP_AONCLKRST_PLL8M_CLK_FORCE_ON_V << LP_AONCLKRST_PLL8M_CLK_FORCE_ON_S)
#define LP_AONCLKRST_PLL8M_CLK_FORCE_ON_V  0x00000001U
#define LP_AONCLKRST_PLL8M_CLK_FORCE_ON_S  29
/** LP_AONCLKRST_XTAL_CLK_FORCE_ON : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_XTAL_CLK_FORCE_ON    (BIT(30))
#define LP_AONCLKRST_XTAL_CLK_FORCE_ON_M  (LP_AONCLKRST_XTAL_CLK_FORCE_ON_V << LP_AONCLKRST_XTAL_CLK_FORCE_ON_S)
#define LP_AONCLKRST_XTAL_CLK_FORCE_ON_V  0x00000001U
#define LP_AONCLKRST_XTAL_CLK_FORCE_ON_S  30
/** LP_AONCLKRST_FOSC_CLK_FORCE_ON : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_FOSC_CLK_FORCE_ON    (BIT(31))
#define LP_AONCLKRST_FOSC_CLK_FORCE_ON_M  (LP_AONCLKRST_FOSC_CLK_FORCE_ON_V << LP_AONCLKRST_FOSC_CLK_FORCE_ON_S)
#define LP_AONCLKRST_FOSC_CLK_FORCE_ON_V  0x00000001U
#define LP_AONCLKRST_FOSC_CLK_FORCE_ON_S  31

/** LP_AONCLKRST_LP_RST_EN_REG register
 *  need_des
 */
#define LP_AONCLKRST_LP_RST_EN_REG (DR_REG_LP_AONCLKRST_BASE + 0xc)
/** LP_AONCLKRST_RST_EN_LP_HUK : R/W; bitpos: [24]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_RST_EN_LP_HUK    (BIT(24))
#define LP_AONCLKRST_RST_EN_LP_HUK_M  (LP_AONCLKRST_RST_EN_LP_HUK_V << LP_AONCLKRST_RST_EN_LP_HUK_S)
#define LP_AONCLKRST_RST_EN_LP_HUK_V  0x00000001U
#define LP_AONCLKRST_RST_EN_LP_HUK_S  24
/** LP_AONCLKRST_RST_EN_LP_ANAPERI : R/W; bitpos: [25]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_RST_EN_LP_ANAPERI    (BIT(25))
#define LP_AONCLKRST_RST_EN_LP_ANAPERI_M  (LP_AONCLKRST_RST_EN_LP_ANAPERI_V << LP_AONCLKRST_RST_EN_LP_ANAPERI_S)
#define LP_AONCLKRST_RST_EN_LP_ANAPERI_V  0x00000001U
#define LP_AONCLKRST_RST_EN_LP_ANAPERI_S  25
/** LP_AONCLKRST_RST_EN_LP_WDT : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_RST_EN_LP_WDT    (BIT(26))
#define LP_AONCLKRST_RST_EN_LP_WDT_M  (LP_AONCLKRST_RST_EN_LP_WDT_V << LP_AONCLKRST_RST_EN_LP_WDT_S)
#define LP_AONCLKRST_RST_EN_LP_WDT_V  0x00000001U
#define LP_AONCLKRST_RST_EN_LP_WDT_S  26
/** LP_AONCLKRST_RST_EN_LP_TIMER : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_RST_EN_LP_TIMER    (BIT(27))
#define LP_AONCLKRST_RST_EN_LP_TIMER_M  (LP_AONCLKRST_RST_EN_LP_TIMER_V << LP_AONCLKRST_RST_EN_LP_TIMER_S)
#define LP_AONCLKRST_RST_EN_LP_TIMER_V  0x00000001U
#define LP_AONCLKRST_RST_EN_LP_TIMER_S  27
/** LP_AONCLKRST_RST_EN_LP_RTC : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_RST_EN_LP_RTC    (BIT(28))
#define LP_AONCLKRST_RST_EN_LP_RTC_M  (LP_AONCLKRST_RST_EN_LP_RTC_V << LP_AONCLKRST_RST_EN_LP_RTC_S)
#define LP_AONCLKRST_RST_EN_LP_RTC_V  0x00000001U
#define LP_AONCLKRST_RST_EN_LP_RTC_S  28
/** LP_AONCLKRST_RST_EN_LP_MAILBOX : R/W; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_RST_EN_LP_MAILBOX    (BIT(29))
#define LP_AONCLKRST_RST_EN_LP_MAILBOX_M  (LP_AONCLKRST_RST_EN_LP_MAILBOX_V << LP_AONCLKRST_RST_EN_LP_MAILBOX_S)
#define LP_AONCLKRST_RST_EN_LP_MAILBOX_V  0x00000001U
#define LP_AONCLKRST_RST_EN_LP_MAILBOX_S  29
/** LP_AONCLKRST_RST_EN_LP_AONEFUSEREG : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_RST_EN_LP_AONEFUSEREG    (BIT(30))
#define LP_AONCLKRST_RST_EN_LP_AONEFUSEREG_M  (LP_AONCLKRST_RST_EN_LP_AONEFUSEREG_V << LP_AONCLKRST_RST_EN_LP_AONEFUSEREG_S)
#define LP_AONCLKRST_RST_EN_LP_AONEFUSEREG_V  0x00000001U
#define LP_AONCLKRST_RST_EN_LP_AONEFUSEREG_S  30
/** LP_AONCLKRST_RST_EN_LP_RAM : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_RST_EN_LP_RAM    (BIT(31))
#define LP_AONCLKRST_RST_EN_LP_RAM_M  (LP_AONCLKRST_RST_EN_LP_RAM_V << LP_AONCLKRST_RST_EN_LP_RAM_S)
#define LP_AONCLKRST_RST_EN_LP_RAM_V  0x00000001U
#define LP_AONCLKRST_RST_EN_LP_RAM_S  31

/** LP_AONCLKRST_RESET_CAUSE_REG register
 *  need_des
 */
#define LP_AONCLKRST_RESET_CAUSE_REG (DR_REG_LP_AONCLKRST_BASE + 0x10)
/** LP_AONCLKRST_LPCORE_RESET_CAUSE : RO; bitpos: [5:0]; default: 0;
 *  6'h1: POR reset
 *  6'h9: PMU LP PERI power down reset
 *  6'ha: PMU LP CPU reset
 *  6'hf: brown out reset
 *  6'h10: LP watchdog chip reset
 *  6'h12: super watch dog reset
 *  6'h13: glitch reset
 *  6'h14: software reset
 */
#define LP_AONCLKRST_LPCORE_RESET_CAUSE    0x0000003FU
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_M  (LP_AONCLKRST_LPCORE_RESET_CAUSE_V << LP_AONCLKRST_LPCORE_RESET_CAUSE_S)
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_V  0x0000003FU
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_S  0
/** LP_AONCLKRST_LPCORE_RESET_FLAG : RO; bitpos: [6]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LPCORE_RESET_FLAG    (BIT(6))
#define LP_AONCLKRST_LPCORE_RESET_FLAG_M  (LP_AONCLKRST_LPCORE_RESET_FLAG_V << LP_AONCLKRST_LPCORE_RESET_FLAG_S)
#define LP_AONCLKRST_LPCORE_RESET_FLAG_V  0x00000001U
#define LP_AONCLKRST_LPCORE_RESET_FLAG_S  6
/** LP_AONCLKRST_HPCORE0_RESET_CAUSE : RO; bitpos: [12:7]; default: 0;
 *  6'h1: POR reset
 *  6'h3: digital system software reset
 *  6'h5: PMU HP system power down reset
 *  6'h7: HP system reset from HP watchdog
 *  6'h9: HP system reset from LP watchdog
 *  6'hb: HP core reset from HP watchdog
 *  6'hc: HP core software reset
 *  6'hd: HP core reset from LP watchdog
 *  6'hf: brown out reset
 *  6'h10: LP watchdog chip reset
 *  6'h12: super watch dog reset
 *  6'h13: glitch reset
 *  6'h14: efuse crc error reset
 *  6'h16: HP usb jtag chip reset
 *  6'h17: HP usb uart chip reset
 *  6'h18: HP jtag reset
 *  6'h1a: HP core lockup
 */
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE    0x0000003FU
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_M  (LP_AONCLKRST_HPCORE0_RESET_CAUSE_V << LP_AONCLKRST_HPCORE0_RESET_CAUSE_S)
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_V  0x0000003FU
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_S  7
/** LP_AONCLKRST_HPCORE0_RESET_FLAG : RO; bitpos: [13]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_RESET_FLAG    (BIT(13))
#define LP_AONCLKRST_HPCORE0_RESET_FLAG_M  (LP_AONCLKRST_HPCORE0_RESET_FLAG_V << LP_AONCLKRST_HPCORE0_RESET_FLAG_S)
#define LP_AONCLKRST_HPCORE0_RESET_FLAG_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_RESET_FLAG_S  13
/** LP_AONCLKRST_HPCORE1_RESET_CAUSE : RO; bitpos: [19:14]; default: 0;
 *  6'h1: POR reset
 *  6'h3: digital system software reset
 *  6'h5: PMU HP system power down reset
 *  6'h7: HP system reset from HP watchdog
 *  6'h9: HP system reset from LP watchdog
 *  6'hb: HP core reset from HP watchdog
 *  6'hc: HP core software reset
 *  6'hd: HP core reset from LP watchdog
 *  6'hf: brown out reset
 *  6'h10: LP watchdog chip reset
 *  6'h12: super watch dog reset
 *  6'h13: glitch reset
 *  6'h14: efuse crc error reset
 *  6'h16: HP usb jtag chip reset
 *  6'h17: HP usb uart chip reset
 *  6'h18: HP jtag reset
 *  6'h1a: HP core lockup
 */
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE    0x0000003FU
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_M  (LP_AONCLKRST_HPCORE1_RESET_CAUSE_V << LP_AONCLKRST_HPCORE1_RESET_CAUSE_S)
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_V  0x0000003FU
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_S  14
/** LP_AONCLKRST_HPCORE1_RESET_FLAG : RO; bitpos: [20]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_RESET_FLAG    (BIT(20))
#define LP_AONCLKRST_HPCORE1_RESET_FLAG_M  (LP_AONCLKRST_HPCORE1_RESET_FLAG_V << LP_AONCLKRST_HPCORE1_RESET_FLAG_S)
#define LP_AONCLKRST_HPCORE1_RESET_FLAG_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_RESET_FLAG_S  20
/** LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK : R/W; bitpos: [25]; default: 1;
 *  1'b0: enable lpcore pmu_lp_cpu_reset reset_cause, 1'b1: disable lpcore
 *  pmu_lp_cpu_reset reset_cause
 */
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK    (BIT(25))
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK_M  (LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK_V << LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK_S)
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK_V  0x00000001U
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK_S  25
/** LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR : WT; bitpos: [26]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR    (BIT(26))
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR_M  (LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR_V << LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR_S)
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR_V  0x00000001U
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR_S  26
/** LP_AONCLKRST_LPCORE_RESET_FLAG_CLR : WT; bitpos: [27]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LPCORE_RESET_FLAG_CLR    (BIT(27))
#define LP_AONCLKRST_LPCORE_RESET_FLAG_CLR_M  (LP_AONCLKRST_LPCORE_RESET_FLAG_CLR_V << LP_AONCLKRST_LPCORE_RESET_FLAG_CLR_S)
#define LP_AONCLKRST_LPCORE_RESET_FLAG_CLR_V  0x00000001U
#define LP_AONCLKRST_LPCORE_RESET_FLAG_CLR_S  27
/** LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR : WT; bitpos: [28]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR    (BIT(28))
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR_M  (LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR_V << LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR_S)
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR_S  28
/** LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR : WT; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR    (BIT(29))
#define LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR_M  (LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR_V << LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR_S)
#define LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR_S  29
/** LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR : WT; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR    (BIT(30))
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR_M  (LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR_V << LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR_S)
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR_S  30
/** LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR    (BIT(31))
#define LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR_M  (LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR_V << LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR_S)
#define LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR_S  31

/** LP_AONCLKRST_HPCPU_RESET_CTRL0_REG register
 *  need_des
 */
#define LP_AONCLKRST_HPCPU_RESET_CTRL0_REG (DR_REG_LP_AONCLKRST_BASE + 0x14)
/** LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN : R/W; bitpos: [0]; default: 0;
 *  write 1 to enable hpcore0 lockup reset feature, write 0 to disable hpcore0 lockup
 *  reset feature
 */
#define LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN    (BIT(0))
#define LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN_M  (LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN_V << LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN_S)
#define LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN_S  0
/** LP_AONCLKRST_LP_WDT_HPCORE0_RESET_LENGTH : R/W; bitpos: [3:1]; default: 1;
 *  need_des
 */
#define LP_AONCLKRST_LP_WDT_HPCORE0_RESET_LENGTH    0x00000007U
#define LP_AONCLKRST_LP_WDT_HPCORE0_RESET_LENGTH_M  (LP_AONCLKRST_LP_WDT_HPCORE0_RESET_LENGTH_V << LP_AONCLKRST_LP_WDT_HPCORE0_RESET_LENGTH_S)
#define LP_AONCLKRST_LP_WDT_HPCORE0_RESET_LENGTH_V  0x00000007U
#define LP_AONCLKRST_LP_WDT_HPCORE0_RESET_LENGTH_S  1
/** LP_AONCLKRST_LP_WDT_HPCORE0_RESET_EN : R/W; bitpos: [4]; default: 0;
 *  write 1 to enable lp_wdt reset hpcore0 feature, write 0 to disable lp_wdt reset
 *  hpcore0 feature
 */
#define LP_AONCLKRST_LP_WDT_HPCORE0_RESET_EN    (BIT(4))
#define LP_AONCLKRST_LP_WDT_HPCORE0_RESET_EN_M  (LP_AONCLKRST_LP_WDT_HPCORE0_RESET_EN_V << LP_AONCLKRST_LP_WDT_HPCORE0_RESET_EN_S)
#define LP_AONCLKRST_LP_WDT_HPCORE0_RESET_EN_V  0x00000001U
#define LP_AONCLKRST_LP_WDT_HPCORE0_RESET_EN_S  4
/** LP_AONCLKRST_HPCORE0_STALL_WAIT : R/W; bitpos: [11:5]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_STALL_WAIT    0x0000007FU
#define LP_AONCLKRST_HPCORE0_STALL_WAIT_M  (LP_AONCLKRST_HPCORE0_STALL_WAIT_V << LP_AONCLKRST_HPCORE0_STALL_WAIT_S)
#define LP_AONCLKRST_HPCORE0_STALL_WAIT_V  0x0000007FU
#define LP_AONCLKRST_HPCORE0_STALL_WAIT_S  5
/** LP_AONCLKRST_HPCORE0_STALL_EN : R/W; bitpos: [12]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_STALL_EN    (BIT(12))
#define LP_AONCLKRST_HPCORE0_STALL_EN_M  (LP_AONCLKRST_HPCORE0_STALL_EN_V << LP_AONCLKRST_HPCORE0_STALL_EN_S)
#define LP_AONCLKRST_HPCORE0_STALL_EN_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_STALL_EN_S  12
/** LP_AONCLKRST_HPCORE0_SW_RESET : WT; bitpos: [13]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_SW_RESET    (BIT(13))
#define LP_AONCLKRST_HPCORE0_SW_RESET_M  (LP_AONCLKRST_HPCORE0_SW_RESET_V << LP_AONCLKRST_HPCORE0_SW_RESET_S)
#define LP_AONCLKRST_HPCORE0_SW_RESET_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_SW_RESET_S  13
/** LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET : R/W; bitpos: [14]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET    (BIT(14))
#define LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET_M  (LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET_V << LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET_S)
#define LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET_S  14
/** LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL : R/W; bitpos: [15]; default: 1;
 *  1'b1: boot from HP TCM ROM: 0x4FC00000
 *  1'b0: boot from LP TCM RAM:  0x50108000
 */
#define LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL    (BIT(15))
#define LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL_M  (LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL_V << LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL_S)
#define LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL_S  15
/** LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN : R/W; bitpos: [16]; default: 0;
 *  write 1 to enable hpcore1 lockup reset feature, write 0 to disable hpcore1 lockup
 *  reset feature
 */
#define LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN    (BIT(16))
#define LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN_M  (LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN_V << LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN_S)
#define LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN_S  16
/** LP_AONCLKRST_LP_WDT_HPCORE1_RESET_LENGTH : R/W; bitpos: [19:17]; default: 1;
 *  need_des
 */
#define LP_AONCLKRST_LP_WDT_HPCORE1_RESET_LENGTH    0x00000007U
#define LP_AONCLKRST_LP_WDT_HPCORE1_RESET_LENGTH_M  (LP_AONCLKRST_LP_WDT_HPCORE1_RESET_LENGTH_V << LP_AONCLKRST_LP_WDT_HPCORE1_RESET_LENGTH_S)
#define LP_AONCLKRST_LP_WDT_HPCORE1_RESET_LENGTH_V  0x00000007U
#define LP_AONCLKRST_LP_WDT_HPCORE1_RESET_LENGTH_S  17
/** LP_AONCLKRST_LP_WDT_HPCORE1_RESET_EN : R/W; bitpos: [20]; default: 0;
 *  write 1 to enable lp_wdt reset hpcore1 feature, write 0 to disable lp_wdt reset
 *  hpcore1 feature
 */
#define LP_AONCLKRST_LP_WDT_HPCORE1_RESET_EN    (BIT(20))
#define LP_AONCLKRST_LP_WDT_HPCORE1_RESET_EN_M  (LP_AONCLKRST_LP_WDT_HPCORE1_RESET_EN_V << LP_AONCLKRST_LP_WDT_HPCORE1_RESET_EN_S)
#define LP_AONCLKRST_LP_WDT_HPCORE1_RESET_EN_V  0x00000001U
#define LP_AONCLKRST_LP_WDT_HPCORE1_RESET_EN_S  20
/** LP_AONCLKRST_HPCORE1_STALL_WAIT : R/W; bitpos: [27:21]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_STALL_WAIT    0x0000007FU
#define LP_AONCLKRST_HPCORE1_STALL_WAIT_M  (LP_AONCLKRST_HPCORE1_STALL_WAIT_V << LP_AONCLKRST_HPCORE1_STALL_WAIT_S)
#define LP_AONCLKRST_HPCORE1_STALL_WAIT_V  0x0000007FU
#define LP_AONCLKRST_HPCORE1_STALL_WAIT_S  21
/** LP_AONCLKRST_HPCORE1_STALL_EN : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_STALL_EN    (BIT(28))
#define LP_AONCLKRST_HPCORE1_STALL_EN_M  (LP_AONCLKRST_HPCORE1_STALL_EN_V << LP_AONCLKRST_HPCORE1_STALL_EN_S)
#define LP_AONCLKRST_HPCORE1_STALL_EN_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_STALL_EN_S  28
/** LP_AONCLKRST_HPCORE1_SW_RESET : WT; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_SW_RESET    (BIT(29))
#define LP_AONCLKRST_HPCORE1_SW_RESET_M  (LP_AONCLKRST_HPCORE1_SW_RESET_V << LP_AONCLKRST_HPCORE1_SW_RESET_S)
#define LP_AONCLKRST_HPCORE1_SW_RESET_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_SW_RESET_S  29
/** LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET    (BIT(30))
#define LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET_M  (LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET_V << LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET_S)
#define LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET_S  30
/** LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL : R/W; bitpos: [31]; default: 1;
 *  1'b1: boot from HP TCM ROM: 0x4FC00000
 *  1'b0: boot from LP TCM RAM:  0x50108000
 */
#define LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL    (BIT(31))
#define LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL_M  (LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL_V << LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL_S)
#define LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL_S  31

