espressif/esp-idf/components/soc/esp32p4/include/soc/lp_aonclkrst_reg.h
/** LP_AONCLKRST_HPCPU_RESET_CTRL1_REG register
 *  need_des
 */
#define LP_AONCLKRST_HPCPU_RESET_CTRL1_REG (DR_REG_LP_AONCLKRST_BASE + 0x18)
/** LP_AONCLKRST_HPCORE0_SW_STALL_CODE : R/W; bitpos: [23:16]; default: 0;
 *  HP core0 software stall when set to 8'h86
 */
#define LP_AONCLKRST_HPCORE0_SW_STALL_CODE    0x000000FFU
#define LP_AONCLKRST_HPCORE0_SW_STALL_CODE_M  (LP_AONCLKRST_HPCORE0_SW_STALL_CODE_V << LP_AONCLKRST_HPCORE0_SW_STALL_CODE_S)
#define LP_AONCLKRST_HPCORE0_SW_STALL_CODE_V  0x000000FFU
#define LP_AONCLKRST_HPCORE0_SW_STALL_CODE_S  16
/** LP_AONCLKRST_HPCORE1_SW_STALL_CODE : R/W; bitpos: [31:24]; default: 0;
 *  HP core1 software stall when set to 8'h86
 */
#define LP_AONCLKRST_HPCORE1_SW_STALL_CODE    0x000000FFU
#define LP_AONCLKRST_HPCORE1_SW_STALL_CODE_M  (LP_AONCLKRST_HPCORE1_SW_STALL_CODE_V << LP_AONCLKRST_HPCORE1_SW_STALL_CODE_S)
#define LP_AONCLKRST_HPCORE1_SW_STALL_CODE_V  0x000000FFU
#define LP_AONCLKRST_HPCORE1_SW_STALL_CODE_S  24

/** LP_AONCLKRST_FOSC_CNTL_REG register
 *  need_des
 */
#define LP_AONCLKRST_FOSC_CNTL_REG (DR_REG_LP_AONCLKRST_BASE + 0x1c)
/** LP_AONCLKRST_FOSC_DFREQ : R/W; bitpos: [31:22]; default: 400;
 *  need_des
 */
#define LP_AONCLKRST_FOSC_DFREQ    0x000003FFU
#define LP_AONCLKRST_FOSC_DFREQ_M  (LP_AONCLKRST_FOSC_DFREQ_V << LP_AONCLKRST_FOSC_DFREQ_S)
#define LP_AONCLKRST_FOSC_DFREQ_V  0x000003FFU
#define LP_AONCLKRST_FOSC_DFREQ_S  22

/** LP_AONCLKRST_RC32K_CNTL_REG register
 *  need_des
 */
#define LP_AONCLKRST_RC32K_CNTL_REG (DR_REG_LP_AONCLKRST_BASE + 0x20)
/** LP_AONCLKRST_RC32K_DFREQ : R/W; bitpos: [31:0]; default: 650;
 *  need_des
 */
#define LP_AONCLKRST_RC32K_DFREQ    0xFFFFFFFFU
#define LP_AONCLKRST_RC32K_DFREQ_M  (LP_AONCLKRST_RC32K_DFREQ_V << LP_AONCLKRST_RC32K_DFREQ_S)
#define LP_AONCLKRST_RC32K_DFREQ_V  0xFFFFFFFFU
#define LP_AONCLKRST_RC32K_DFREQ_S  0

/** LP_AONCLKRST_SOSC_CNTL_REG register
 *  need_des
 */
#define LP_AONCLKRST_SOSC_CNTL_REG (DR_REG_LP_AONCLKRST_BASE + 0x24)
/** LP_AONCLKRST_SOSC_DFREQ : R/W; bitpos: [31:22]; default: 172;
 *  need_des
 */
#define LP_AONCLKRST_SOSC_DFREQ    0x000003FFU
#define LP_AONCLKRST_SOSC_DFREQ_M  (LP_AONCLKRST_SOSC_DFREQ_V << LP_AONCLKRST_SOSC_DFREQ_S)
#define LP_AONCLKRST_SOSC_DFREQ_V  0x000003FFU
#define LP_AONCLKRST_SOSC_DFREQ_S  22

/** LP_AONCLKRST_CLK_TO_HP_REG register
 *  need_des
 */
#define LP_AONCLKRST_CLK_TO_HP_REG (DR_REG_LP_AONCLKRST_BASE + 0x28)
/** LP_AONCLKRST_ICG_HP_XTAL32K : R/W; bitpos: [28]; default: 1;
 *  reserved
 */
#define LP_AONCLKRST_ICG_HP_XTAL32K    (BIT(28))
#define LP_AONCLKRST_ICG_HP_XTAL32K_M  (LP_AONCLKRST_ICG_HP_XTAL32K_V << LP_AONCLKRST_ICG_HP_XTAL32K_S)
#define LP_AONCLKRST_ICG_HP_XTAL32K_V  0x00000001U
#define LP_AONCLKRST_ICG_HP_XTAL32K_S  28
/** LP_AONCLKRST_ICG_HP_SOSC : R/W; bitpos: [29]; default: 1;
 *  reserved
 */
#define LP_AONCLKRST_ICG_HP_SOSC    (BIT(29))
#define LP_AONCLKRST_ICG_HP_SOSC_M  (LP_AONCLKRST_ICG_HP_SOSC_V << LP_AONCLKRST_ICG_HP_SOSC_S)
#define LP_AONCLKRST_ICG_HP_SOSC_V  0x00000001U
#define LP_AONCLKRST_ICG_HP_SOSC_S  29
/** LP_AONCLKRST_ICG_HP_OSC32K : R/W; bitpos: [30]; default: 1;
 *  reserved
 */
#define LP_AONCLKRST_ICG_HP_OSC32K    (BIT(30))
#define LP_AONCLKRST_ICG_HP_OSC32K_M  (LP_AONCLKRST_ICG_HP_OSC32K_V << LP_AONCLKRST_ICG_HP_OSC32K_S)
#define LP_AONCLKRST_ICG_HP_OSC32K_V  0x00000001U
#define LP_AONCLKRST_ICG_HP_OSC32K_S  30
/** LP_AONCLKRST_ICG_HP_FOSC : R/W; bitpos: [31]; default: 1;
 *  reserved
 */
#define LP_AONCLKRST_ICG_HP_FOSC    (BIT(31))
#define LP_AONCLKRST_ICG_HP_FOSC_M  (LP_AONCLKRST_ICG_HP_FOSC_V << LP_AONCLKRST_ICG_HP_FOSC_S)
#define LP_AONCLKRST_ICG_HP_FOSC_V  0x00000001U
#define LP_AONCLKRST_ICG_HP_FOSC_S  31

/** LP_AONCLKRST_LPMEM_FORCE_REG register
 *  need_des
 */
#define LP_AONCLKRST_LPMEM_FORCE_REG (DR_REG_LP_AONCLKRST_BASE + 0x2c)
/** LP_AONCLKRST_LPMEM_CLK_FORCE_ON : R/W; bitpos: [31]; default: 0;
 *  reserved
 */
#define LP_AONCLKRST_LPMEM_CLK_FORCE_ON    (BIT(31))
#define LP_AONCLKRST_LPMEM_CLK_FORCE_ON_M  (LP_AONCLKRST_LPMEM_CLK_FORCE_ON_V << LP_AONCLKRST_LPMEM_CLK_FORCE_ON_S)
#define LP_AONCLKRST_LPMEM_CLK_FORCE_ON_V  0x00000001U
#define LP_AONCLKRST_LPMEM_CLK_FORCE_ON_S  31

/** LP_AONCLKRST_XTAL32K_REG register
 *  need_des
 */
#define LP_AONCLKRST_XTAL32K_REG (DR_REG_LP_AONCLKRST_BASE + 0x30)
/** LP_AONCLKRST_DRES_XTAL32K : R/W; bitpos: [24:22]; default: 3;
 *  need_des
 */
#define LP_AONCLKRST_DRES_XTAL32K    0x00000007U
#define LP_AONCLKRST_DRES_XTAL32K_M  (LP_AONCLKRST_DRES_XTAL32K_V << LP_AONCLKRST_DRES_XTAL32K_S)
#define LP_AONCLKRST_DRES_XTAL32K_V  0x00000007U
#define LP_AONCLKRST_DRES_XTAL32K_S  22
/** LP_AONCLKRST_DGM_XTAL32K : R/W; bitpos: [27:25]; default: 3;
 *  need_des
 */
#define LP_AONCLKRST_DGM_XTAL32K    0x00000007U
#define LP_AONCLKRST_DGM_XTAL32K_M  (LP_AONCLKRST_DGM_XTAL32K_V << LP_AONCLKRST_DGM_XTAL32K_S)
#define LP_AONCLKRST_DGM_XTAL32K_V  0x00000007U
#define LP_AONCLKRST_DGM_XTAL32K_S  25
/** LP_AONCLKRST_DBUF_XTAL32K : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_DBUF_XTAL32K    (BIT(28))
#define LP_AONCLKRST_DBUF_XTAL32K_M  (LP_AONCLKRST_DBUF_XTAL32K_V << LP_AONCLKRST_DBUF_XTAL32K_S)
#define LP_AONCLKRST_DBUF_XTAL32K_V  0x00000001U
#define LP_AONCLKRST_DBUF_XTAL32K_S  28
/** LP_AONCLKRST_DAC_XTAL32K : R/W; bitpos: [31:29]; default: 3;
 *  need_des
 */
#define LP_AONCLKRST_DAC_XTAL32K    0x00000007U
#define LP_AONCLKRST_DAC_XTAL32K_M  (LP_AONCLKRST_DAC_XTAL32K_V << LP_AONCLKRST_DAC_XTAL32K_S)
#define LP_AONCLKRST_DAC_XTAL32K_V  0x00000007U
#define LP_AONCLKRST_DAC_XTAL32K_S  29

/** LP_AONCLKRST_MUX_HPSYS_RESET_BYPASS_REG register
 *  need_des
 */
#define LP_AONCLKRST_MUX_HPSYS_RESET_BYPASS_REG (DR_REG_LP_AONCLKRST_BASE + 0x34)
/** LP_AONCLKRST_MUX_HPSYS_RESET_BYPASS : R/W; bitpos: [31:0]; default: 4294967295;
 *  reserved
 */
#define LP_AONCLKRST_MUX_HPSYS_RESET_BYPASS    0xFFFFFFFFU
#define LP_AONCLKRST_MUX_HPSYS_RESET_BYPASS_M  (LP_AONCLKRST_MUX_HPSYS_RESET_BYPASS_V << LP_AONCLKRST_MUX_HPSYS_RESET_BYPASS_S)
#define LP_AONCLKRST_MUX_HPSYS_RESET_BYPASS_V  0xFFFFFFFFU
#define LP_AONCLKRST_MUX_HPSYS_RESET_BYPASS_S  0

/** LP_AONCLKRST_HPSYS_0_RESET_BYPASS_REG register
 *  need_des
 */
#define LP_AONCLKRST_HPSYS_0_RESET_BYPASS_REG (DR_REG_LP_AONCLKRST_BASE + 0x38)
/** LP_AONCLKRST_HPSYS_0_RESET_BYPASS : R/W; bitpos: [31:0]; default: 4294967295;
 *  reserved
 */
#define LP_AONCLKRST_HPSYS_0_RESET_BYPASS    0xFFFFFFFFU
#define LP_AONCLKRST_HPSYS_0_RESET_BYPASS_M  (LP_AONCLKRST_HPSYS_0_RESET_BYPASS_V << LP_AONCLKRST_HPSYS_0_RESET_BYPASS_S)
#define LP_AONCLKRST_HPSYS_0_RESET_BYPASS_V  0xFFFFFFFFU
#define LP_AONCLKRST_HPSYS_0_RESET_BYPASS_S  0

/** LP_AONCLKRST_HPSYS_APM_RESET_BYPASS_REG register
 *  need_des
 */
#define LP_AONCLKRST_HPSYS_APM_RESET_BYPASS_REG (DR_REG_LP_AONCLKRST_BASE + 0x3c)
/** LP_AONCLKRST_HPSYS_APM_RESET_BYPASS : R/W; bitpos: [31:0]; default: 4294967295;
 *  reserved
 */
#define LP_AONCLKRST_HPSYS_APM_RESET_BYPASS    0xFFFFFFFFU
#define LP_AONCLKRST_HPSYS_APM_RESET_BYPASS_M  (LP_AONCLKRST_HPSYS_APM_RESET_BYPASS_V << LP_AONCLKRST_HPSYS_APM_RESET_BYPASS_S)
#define LP_AONCLKRST_HPSYS_APM_RESET_BYPASS_V  0xFFFFFFFFU
#define LP_AONCLKRST_HPSYS_APM_RESET_BYPASS_S  0

/** LP_AONCLKRST_HP_CLK_CTRL_REG register
 *  HP Clock Control Register.
 */
#define LP_AONCLKRST_HP_CLK_CTRL_REG (DR_REG_LP_AONCLKRST_BASE + 0x40)
/** LP_AONCLKRST_HP_ROOT_CLK_SRC_SEL : R/W; bitpos: [1:0]; default: 0;
 *  HP SoC Root Clock Source Select. 2'd0: xtal_40m, 2'd1: cpll_400m, 2'd2: fosc_20m.
 */
#define LP_AONCLKRST_HP_ROOT_CLK_SRC_SEL    0x00000003U
#define LP_AONCLKRST_HP_ROOT_CLK_SRC_SEL_M  (LP_AONCLKRST_HP_ROOT_CLK_SRC_SEL_V << LP_AONCLKRST_HP_ROOT_CLK_SRC_SEL_S)
#define LP_AONCLKRST_HP_ROOT_CLK_SRC_SEL_V  0x00000003U
#define LP_AONCLKRST_HP_ROOT_CLK_SRC_SEL_S  0
/** LP_AONCLKRST_HP_ROOT_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  HP SoC Root Clock Enable.
 */
#define LP_AONCLKRST_HP_ROOT_CLK_EN    (BIT(2))
#define LP_AONCLKRST_HP_ROOT_CLK_EN_M  (LP_AONCLKRST_HP_ROOT_CLK_EN_V << LP_AONCLKRST_HP_ROOT_CLK_EN_S)
#define LP_AONCLKRST_HP_ROOT_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_ROOT_CLK_EN_S  2
/** LP_AONCLKRST_HP_PAD_PARLIO_TX_CLK_EN : R/W; bitpos: [3]; default: 1;
 *  PARLIO TX Clock From Pad Enable.
 */
#define LP_AONCLKRST_HP_PAD_PARLIO_TX_CLK_EN    (BIT(3))
#define LP_AONCLKRST_HP_PAD_PARLIO_TX_CLK_EN_M  (LP_AONCLKRST_HP_PAD_PARLIO_TX_CLK_EN_V << LP_AONCLKRST_HP_PAD_PARLIO_TX_CLK_EN_S)
#define LP_AONCLKRST_HP_PAD_PARLIO_TX_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_PAD_PARLIO_TX_CLK_EN_S  3
/** LP_AONCLKRST_HP_PAD_PARLIO_RX_CLK_EN : R/W; bitpos: [4]; default: 1;
 *  PARLIO RX Clock From Pad Enable.
 */
#define LP_AONCLKRST_HP_PAD_PARLIO_RX_CLK_EN    (BIT(4))
#define LP_AONCLKRST_HP_PAD_PARLIO_RX_CLK_EN_M  (LP_AONCLKRST_HP_PAD_PARLIO_RX_CLK_EN_V << LP_AONCLKRST_HP_PAD_PARLIO_RX_CLK_EN_S)
#define LP_AONCLKRST_HP_PAD_PARLIO_RX_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_PAD_PARLIO_RX_CLK_EN_S  4
/** LP_AONCLKRST_HP_PAD_UART4_SLP_CLK_EN : R/W; bitpos: [5]; default: 1;
 *  UART4 SLP Clock From Pad Enable.
 */
#define LP_AONCLKRST_HP_PAD_UART4_SLP_CLK_EN    (BIT(5))
#define LP_AONCLKRST_HP_PAD_UART4_SLP_CLK_EN_M  (LP_AONCLKRST_HP_PAD_UART4_SLP_CLK_EN_V << LP_AONCLKRST_HP_PAD_UART4_SLP_CLK_EN_S)
#define LP_AONCLKRST_HP_PAD_UART4_SLP_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_PAD_UART4_SLP_CLK_EN_S  5
/** LP_AONCLKRST_HP_PAD_UART3_SLP_CLK_EN : R/W; bitpos: [6]; default: 1;
 *  UART3 SLP Clock From Pad Enable.
 */
#define LP_AONCLKRST_HP_PAD_UART3_SLP_CLK_EN    (BIT(6))
#define LP_AONCLKRST_HP_PAD_UART3_SLP_CLK_EN_M  (LP_AONCLKRST_HP_PAD_UART3_SLP_CLK_EN_V << LP_AONCLKRST_HP_PAD_UART3_SLP_CLK_EN_S)
#define LP_AONCLKRST_HP_PAD_UART3_SLP_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_PAD_UART3_SLP_CLK_EN_S  6
/** LP_AONCLKRST_HP_PAD_UART2_SLP_CLK_EN : R/W; bitpos: [7]; default: 1;
 *  UART2 SLP Clock From Pad Enable.
 */
#define LP_AONCLKRST_HP_PAD_UART2_SLP_CLK_EN    (BIT(7))
#define LP_AONCLKRST_HP_PAD_UART2_SLP_CLK_EN_M  (LP_AONCLKRST_HP_PAD_UART2_SLP_CLK_EN_V << LP_AONCLKRST_HP_PAD_UART2_SLP_CLK_EN_S)
#define LP_AONCLKRST_HP_PAD_UART2_SLP_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_PAD_UART2_SLP_CLK_EN_S  7
/** LP_AONCLKRST_HP_PAD_UART1_SLP_CLK_EN : R/W; bitpos: [8]; default: 1;
 *  UART1 SLP Clock From Pad Enable.
 */
#define LP_AONCLKRST_HP_PAD_UART1_SLP_CLK_EN    (BIT(8))
#define LP_AONCLKRST_HP_PAD_UART1_SLP_CLK_EN_M  (LP_AONCLKRST_HP_PAD_UART1_SLP_CLK_EN_V << LP_AONCLKRST_HP_PAD_UART1_SLP_CLK_EN_S)
#define LP_AONCLKRST_HP_PAD_UART1_SLP_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_PAD_UART1_SLP_CLK_EN_S  8
/** LP_AONCLKRST_HP_PAD_UART0_SLP_CLK_EN : R/W; bitpos: [9]; default: 1;
 *  UART0 SLP Clock From Pad Enable.
 */
#define LP_AONCLKRST_HP_PAD_UART0_SLP_CLK_EN    (BIT(9))
#define LP_AONCLKRST_HP_PAD_UART0_SLP_CLK_EN_M  (LP_AONCLKRST_HP_PAD_UART0_SLP_CLK_EN_V << LP_AONCLKRST_HP_PAD_UART0_SLP_CLK_EN_S)
#define LP_AONCLKRST_HP_PAD_UART0_SLP_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_PAD_UART0_SLP_CLK_EN_S  9
/** LP_AONCLKRST_HP_PAD_I2S2_MCLK_EN : R/W; bitpos: [10]; default: 1;
 *  I2S2 MCLK Clock From Pad Enable.
 */
#define LP_AONCLKRST_HP_PAD_I2S2_MCLK_EN    (BIT(10))
#define LP_AONCLKRST_HP_PAD_I2S2_MCLK_EN_M  (LP_AONCLKRST_HP_PAD_I2S2_MCLK_EN_V << LP_AONCLKRST_HP_PAD_I2S2_MCLK_EN_S)
#define LP_AONCLKRST_HP_PAD_I2S2_MCLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_PAD_I2S2_MCLK_EN_S  10
/** LP_AONCLKRST_HP_PAD_I2S1_MCLK_EN : R/W; bitpos: [11]; default: 1;
 *  I2S1 MCLK Clock From Pad Enable.
 */
#define LP_AONCLKRST_HP_PAD_I2S1_MCLK_EN    (BIT(11))
#define LP_AONCLKRST_HP_PAD_I2S1_MCLK_EN_M  (LP_AONCLKRST_HP_PAD_I2S1_MCLK_EN_V << LP_AONCLKRST_HP_PAD_I2S1_MCLK_EN_S)
#define LP_AONCLKRST_HP_PAD_I2S1_MCLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_PAD_I2S1_MCLK_EN_S  11
/** LP_AONCLKRST_HP_PAD_I2S0_MCLK_EN : R/W; bitpos: [12]; default: 1;
 *  I2S0 MCLK Clock From Pad Enable.
 */
#define LP_AONCLKRST_HP_PAD_I2S0_MCLK_EN    (BIT(12))
#define LP_AONCLKRST_HP_PAD_I2S0_MCLK_EN_M  (LP_AONCLKRST_HP_PAD_I2S0_MCLK_EN_V << LP_AONCLKRST_HP_PAD_I2S0_MCLK_EN_S)
#define LP_AONCLKRST_HP_PAD_I2S0_MCLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_PAD_I2S0_MCLK_EN_S  12
/** LP_AONCLKRST_HP_PAD_EMAC_TX_CLK_EN : R/W; bitpos: [13]; default: 1;
 *  EMAC RX Clock From Pad Enable.
 */
#define LP_AONCLKRST_HP_PAD_EMAC_TX_CLK_EN    (BIT(13))
#define LP_AONCLKRST_HP_PAD_EMAC_TX_CLK_EN_M  (LP_AONCLKRST_HP_PAD_EMAC_TX_CLK_EN_V << LP_AONCLKRST_HP_PAD_EMAC_TX_CLK_EN_S)
#define LP_AONCLKRST_HP_PAD_EMAC_TX_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_PAD_EMAC_TX_CLK_EN_S  13
/** LP_AONCLKRST_HP_PAD_EMAC_RX_CLK_EN : R/W; bitpos: [14]; default: 1;
 *  EMAC TX Clock From Pad Enable.
 */
#define LP_AONCLKRST_HP_PAD_EMAC_RX_CLK_EN    (BIT(14))
#define LP_AONCLKRST_HP_PAD_EMAC_RX_CLK_EN_M  (LP_AONCLKRST_HP_PAD_EMAC_RX_CLK_EN_V << LP_AONCLKRST_HP_PAD_EMAC_RX_CLK_EN_S)
#define LP_AONCLKRST_HP_PAD_EMAC_RX_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_PAD_EMAC_RX_CLK_EN_S  14
/** LP_AONCLKRST_HP_PAD_EMAC_TXRX_CLK_EN : R/W; bitpos: [15]; default: 1;
 *  EMAC TXRX Clock From Pad Enable.
 */
#define LP_AONCLKRST_HP_PAD_EMAC_TXRX_CLK_EN    (BIT(15))
#define LP_AONCLKRST_HP_PAD_EMAC_TXRX_CLK_EN_M  (LP_AONCLKRST_HP_PAD_EMAC_TXRX_CLK_EN_V << LP_AONCLKRST_HP_PAD_EMAC_TXRX_CLK_EN_S)
#define LP_AONCLKRST_HP_PAD_EMAC_TXRX_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_PAD_EMAC_TXRX_CLK_EN_S  15
/** LP_AONCLKRST_HP_XTAL_32K_CLK_EN : R/W; bitpos: [16]; default: 1;
 *  XTAL 32K Clock Enable.
 */
#define LP_AONCLKRST_HP_XTAL_32K_CLK_EN    (BIT(16))
#define LP_AONCLKRST_HP_XTAL_32K_CLK_EN_M  (LP_AONCLKRST_HP_XTAL_32K_CLK_EN_V << LP_AONCLKRST_HP_XTAL_32K_CLK_EN_S)
#define LP_AONCLKRST_HP_XTAL_32K_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_XTAL_32K_CLK_EN_S  16
/** LP_AONCLKRST_HP_RC_32K_CLK_EN : R/W; bitpos: [17]; default: 1;
 *  RC 32K Clock Enable.
 */
#define LP_AONCLKRST_HP_RC_32K_CLK_EN    (BIT(17))
#define LP_AONCLKRST_HP_RC_32K_CLK_EN_M  (LP_AONCLKRST_HP_RC_32K_CLK_EN_V << LP_AONCLKRST_HP_RC_32K_CLK_EN_S)
#define LP_AONCLKRST_HP_RC_32K_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_RC_32K_CLK_EN_S  17
/** LP_AONCLKRST_HP_SOSC_150K_CLK_EN : R/W; bitpos: [18]; default: 1;
 *  SOSC 150K Clock Enable.
 */
#define LP_AONCLKRST_HP_SOSC_150K_CLK_EN    (BIT(18))
#define LP_AONCLKRST_HP_SOSC_150K_CLK_EN_M  (LP_AONCLKRST_HP_SOSC_150K_CLK_EN_V << LP_AONCLKRST_HP_SOSC_150K_CLK_EN_S)
#define LP_AONCLKRST_HP_SOSC_150K_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_SOSC_150K_CLK_EN_S  18
/** LP_AONCLKRST_HP_PLL_8M_CLK_EN : R/W; bitpos: [19]; default: 1;
 *  PLL 8M Clock Enable.
 */
#define LP_AONCLKRST_HP_PLL_8M_CLK_EN    (BIT(19))
#define LP_AONCLKRST_HP_PLL_8M_CLK_EN_M  (LP_AONCLKRST_HP_PLL_8M_CLK_EN_V << LP_AONCLKRST_HP_PLL_8M_CLK_EN_S)
#define LP_AONCLKRST_HP_PLL_8M_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_PLL_8M_CLK_EN_S  19
/** LP_AONCLKRST_HP_AUDIO_PLL_CLK_EN : R/W; bitpos: [20]; default: 1;
 *  AUDIO PLL Clock Enable.
 */
#define LP_AONCLKRST_HP_AUDIO_PLL_CLK_EN    (BIT(20))
#define LP_AONCLKRST_HP_AUDIO_PLL_CLK_EN_M  (LP_AONCLKRST_HP_AUDIO_PLL_CLK_EN_V << LP_AONCLKRST_HP_AUDIO_PLL_CLK_EN_S)
#define LP_AONCLKRST_HP_AUDIO_PLL_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_AUDIO_PLL_CLK_EN_S  20
/** LP_AONCLKRST_HP_SDIO_PLL2_CLK_EN : R/W; bitpos: [21]; default: 1;
 *  SDIO PLL2 Clock Enable.
 */
#define LP_AONCLKRST_HP_SDIO_PLL2_CLK_EN    (BIT(21))
#define LP_AONCLKRST_HP_SDIO_PLL2_CLK_EN_M  (LP_AONCLKRST_HP_SDIO_PLL2_CLK_EN_V << LP_AONCLKRST_HP_SDIO_PLL2_CLK_EN_S)
#define LP_AONCLKRST_HP_SDIO_PLL2_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_SDIO_PLL2_CLK_EN_S  21
/** LP_AONCLKRST_HP_SDIO_PLL1_CLK_EN : R/W; bitpos: [22]; default: 1;
 *  SDIO PLL1 Clock Enable.
 */
#define LP_AONCLKRST_HP_SDIO_PLL1_CLK_EN    (BIT(22))
#define LP_AONCLKRST_HP_SDIO_PLL1_CLK_EN_M  (LP_AONCLKRST_HP_SDIO_PLL1_CLK_EN_V << LP_AONCLKRST_HP_SDIO_PLL1_CLK_EN_S)
#define LP_AONCLKRST_HP_SDIO_PLL1_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_SDIO_PLL1_CLK_EN_S  22
/** LP_AONCLKRST_HP_SDIO_PLL0_CLK_EN : R/W; bitpos: [23]; default: 1;
 *  SDIO PLL0 Clock Enable.
 */
#define LP_AONCLKRST_HP_SDIO_PLL0_CLK_EN    (BIT(23))
#define LP_AONCLKRST_HP_SDIO_PLL0_CLK_EN_M  (LP_AONCLKRST_HP_SDIO_PLL0_CLK_EN_V << LP_AONCLKRST_HP_SDIO_PLL0_CLK_EN_S)
#define LP_AONCLKRST_HP_SDIO_PLL0_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_SDIO_PLL0_CLK_EN_S  23
/** LP_AONCLKRST_HP_FOSC_20M_CLK_EN : R/W; bitpos: [24]; default: 1;
 *  FOSC 20M Clock Enable.
 */
#define LP_AONCLKRST_HP_FOSC_20M_CLK_EN    (BIT(24))
#define LP_AONCLKRST_HP_FOSC_20M_CLK_EN_M  (LP_AONCLKRST_HP_FOSC_20M_CLK_EN_V << LP_AONCLKRST_HP_FOSC_20M_CLK_EN_S)
#define LP_AONCLKRST_HP_FOSC_20M_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_FOSC_20M_CLK_EN_S  24
/** LP_AONCLKRST_HP_XTAL_40M_CLK_EN : R/W; bitpos: [25]; default: 1;
 *  XTAL 40M Clock Enalbe.
 */
#define LP_AONCLKRST_HP_XTAL_40M_CLK_EN    (BIT(25))
#define LP_AONCLKRST_HP_XTAL_40M_CLK_EN_M  (LP_AONCLKRST_HP_XTAL_40M_CLK_EN_V << LP_AONCLKRST_HP_XTAL_40M_CLK_EN_S)
#define LP_AONCLKRST_HP_XTAL_40M_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_XTAL_40M_CLK_EN_S  25
/** LP_AONCLKRST_HP_CPLL_400M_CLK_EN : R/W; bitpos: [26]; default: 1;
 *  CPLL 400M Clock Enable.
 */
#define LP_AONCLKRST_HP_CPLL_400M_CLK_EN    (BIT(26))
#define LP_AONCLKRST_HP_CPLL_400M_CLK_EN_M  (LP_AONCLKRST_HP_CPLL_400M_CLK_EN_V << LP_AONCLKRST_HP_CPLL_400M_CLK_EN_S)
#define LP_AONCLKRST_HP_CPLL_400M_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_CPLL_400M_CLK_EN_S  26
/** LP_AONCLKRST_HP_SPLL_480M_CLK_EN : R/W; bitpos: [27]; default: 1;
 *  SPLL 480M Clock Enable.
 */
#define LP_AONCLKRST_HP_SPLL_480M_CLK_EN    (BIT(27))
#define LP_AONCLKRST_HP_SPLL_480M_CLK_EN_M  (LP_AONCLKRST_HP_SPLL_480M_CLK_EN_V << LP_AONCLKRST_HP_SPLL_480M_CLK_EN_S)
#define LP_AONCLKRST_HP_SPLL_480M_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_SPLL_480M_CLK_EN_S  27
/** LP_AONCLKRST_HP_MPLL_500M_CLK_EN : R/W; bitpos: [28]; default: 1;
 *  MPLL 500M Clock Enable.
 */
#define LP_AONCLKRST_HP_MPLL_500M_CLK_EN    (BIT(28))
#define LP_AONCLKRST_HP_MPLL_500M_CLK_EN_M  (LP_AONCLKRST_HP_MPLL_500M_CLK_EN_V << LP_AONCLKRST_HP_MPLL_500M_CLK_EN_S)
#define LP_AONCLKRST_HP_MPLL_500M_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_HP_MPLL_500M_CLK_EN_S  28

/** LP_AONCLKRST_HP_USB_CLKRST_CTRL0_REG register
 *  HP USB Clock Reset Control Register.
 */
#define LP_AONCLKRST_HP_USB_CLKRST_CTRL0_REG (DR_REG_LP_AONCLKRST_BASE + 0x44)
/** LP_AONCLKRST_USB_OTG20_SLEEP_MODE : R/W; bitpos: [0]; default: 0;
 *  unused.
 */
#define LP_AONCLKRST_USB_OTG20_SLEEP_MODE    (BIT(0))
#define LP_AONCLKRST_USB_OTG20_SLEEP_MODE_M  (LP_AONCLKRST_USB_OTG20_SLEEP_MODE_V << LP_AONCLKRST_USB_OTG20_SLEEP_MODE_S)
#define LP_AONCLKRST_USB_OTG20_SLEEP_MODE_V  0x00000001U
#define LP_AONCLKRST_USB_OTG20_SLEEP_MODE_S  0
/** LP_AONCLKRST_USB_OTG20_BK_SYS_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  unused.
 */
#define LP_AONCLKRST_USB_OTG20_BK_SYS_CLK_EN    (BIT(1))
#define LP_AONCLKRST_USB_OTG20_BK_SYS_CLK_EN_M  (LP_AONCLKRST_USB_OTG20_BK_SYS_CLK_EN_V << LP_AONCLKRST_USB_OTG20_BK_SYS_CLK_EN_S)
#define LP_AONCLKRST_USB_OTG20_BK_SYS_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_USB_OTG20_BK_SYS_CLK_EN_S  1
/** LP_AONCLKRST_USB_OTG11_SLEEP_MODE : R/W; bitpos: [2]; default: 0;
 *  unused.
 */
#define LP_AONCLKRST_USB_OTG11_SLEEP_MODE    (BIT(2))
#define LP_AONCLKRST_USB_OTG11_SLEEP_MODE_M  (LP_AONCLKRST_USB_OTG11_SLEEP_MODE_V << LP_AONCLKRST_USB_OTG11_SLEEP_MODE_S)
#define LP_AONCLKRST_USB_OTG11_SLEEP_MODE_V  0x00000001U
#define LP_AONCLKRST_USB_OTG11_SLEEP_MODE_S  2
/** LP_AONCLKRST_USB_OTG11_BK_SYS_CLK_EN : R/W; bitpos: [3]; default: 1;
 *  unused.
 */
#define LP_AONCLKRST_USB_OTG11_BK_SYS_CLK_EN    (BIT(3))
#define LP_AONCLKRST_USB_OTG11_BK_SYS_CLK_EN_M  (LP_AONCLKRST_USB_OTG11_BK_SYS_CLK_EN_V << LP_AONCLKRST_USB_OTG11_BK_SYS_CLK_EN_S)
#define LP_AONCLKRST_USB_OTG11_BK_SYS_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_USB_OTG11_BK_SYS_CLK_EN_S  3
/** LP_AONCLKRST_USB_OTG11_48M_CLK_EN : R/W; bitpos: [4]; default: 1;
 *  usb otg11 fs phy clock enable.
 */
#define LP_AONCLKRST_USB_OTG11_48M_CLK_EN    (BIT(4))
#define LP_AONCLKRST_USB_OTG11_48M_CLK_EN_M  (LP_AONCLKRST_USB_OTG11_48M_CLK_EN_V << LP_AONCLKRST_USB_OTG11_48M_CLK_EN_S)
#define LP_AONCLKRST_USB_OTG11_48M_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_USB_OTG11_48M_CLK_EN_S  4
/** LP_AONCLKRST_USB_DEVICE_48M_CLK_EN : R/W; bitpos: [5]; default: 1;
 *  usb device fs phy clock enable.
 */
#define LP_AONCLKRST_USB_DEVICE_48M_CLK_EN    (BIT(5))
#define LP_AONCLKRST_USB_DEVICE_48M_CLK_EN_M  (LP_AONCLKRST_USB_DEVICE_48M_CLK_EN_V << LP_AONCLKRST_USB_DEVICE_48M_CLK_EN_S)
#define LP_AONCLKRST_USB_DEVICE_48M_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_USB_DEVICE_48M_CLK_EN_S  5
/** LP_AONCLKRST_USB_48M_DIV_NUM : R/W; bitpos: [13:6]; default: 9;
 *  usb 480m to 25m divide number.
 */
#define LP_AONCLKRST_USB_48M_DIV_NUM    0x000000FFU
#define LP_AONCLKRST_USB_48M_DIV_NUM_M  (LP_AONCLKRST_USB_48M_DIV_NUM_V << LP_AONCLKRST_USB_48M_DIV_NUM_S)
#define LP_AONCLKRST_USB_48M_DIV_NUM_V  0x000000FFU
#define LP_AONCLKRST_USB_48M_DIV_NUM_S  6
/** LP_AONCLKRST_USB_25M_DIV_NUM : R/W; bitpos: [21:14]; default: 19;
 *  usb 500m to 25m divide number.
 */
#define LP_AONCLKRST_USB_25M_DIV_NUM    0x000000FFU
#define LP_AONCLKRST_USB_25M_DIV_NUM_M  (LP_AONCLKRST_USB_25M_DIV_NUM_V << LP_AONCLKRST_USB_25M_DIV_NUM_S)
#define LP_AONCLKRST_USB_25M_DIV_NUM_V  0x000000FFU
#define LP_AONCLKRST_USB_25M_DIV_NUM_S  14
/** LP_AONCLKRST_USB_12M_DIV_NUM : R/W; bitpos: [29:22]; default: 39;
 *  usb 480m to 12m divide number.
 */
#define LP_AONCLKRST_USB_12M_DIV_NUM    0x000000FFU
#define LP_AONCLKRST_USB_12M_DIV_NUM_M  (LP_AONCLKRST_USB_12M_DIV_NUM_V << LP_AONCLKRST_USB_12M_DIV_NUM_S)
#define LP_AONCLKRST_USB_12M_DIV_NUM_V  0x000000FFU
#define LP_AONCLKRST_USB_12M_DIV_NUM_S  22

