espressif/esp-idf/components/soc/esp32p4/include/soc/lp_aonclkrst_reg.h
/** LP_AONCLKRST_HP_USB_CLKRST_CTRL1_REG register
 *  HP USB Clock Reset Control Register.
 */
#define LP_AONCLKRST_HP_USB_CLKRST_CTRL1_REG (DR_REG_LP_AONCLKRST_BASE + 0x48)
/** LP_AONCLKRST_RST_EN_USB_OTG20_ADP : R/W; bitpos: [0]; default: 0;
 *  usb otg20 adp reset en
 */
#define LP_AONCLKRST_RST_EN_USB_OTG20_ADP    (BIT(0))
#define LP_AONCLKRST_RST_EN_USB_OTG20_ADP_M  (LP_AONCLKRST_RST_EN_USB_OTG20_ADP_V << LP_AONCLKRST_RST_EN_USB_OTG20_ADP_S)
#define LP_AONCLKRST_RST_EN_USB_OTG20_ADP_V  0x00000001U
#define LP_AONCLKRST_RST_EN_USB_OTG20_ADP_S  0
/** LP_AONCLKRST_RST_EN_USB_OTG20_PHY : R/W; bitpos: [1]; default: 0;
 *  usb otg20 phy reset en
 */
#define LP_AONCLKRST_RST_EN_USB_OTG20_PHY    (BIT(1))
#define LP_AONCLKRST_RST_EN_USB_OTG20_PHY_M  (LP_AONCLKRST_RST_EN_USB_OTG20_PHY_V << LP_AONCLKRST_RST_EN_USB_OTG20_PHY_S)
#define LP_AONCLKRST_RST_EN_USB_OTG20_PHY_V  0x00000001U
#define LP_AONCLKRST_RST_EN_USB_OTG20_PHY_S  1
/** LP_AONCLKRST_RST_EN_USB_OTG20 : R/W; bitpos: [2]; default: 0;
 *  usb otg20 reset en
 */
#define LP_AONCLKRST_RST_EN_USB_OTG20    (BIT(2))
#define LP_AONCLKRST_RST_EN_USB_OTG20_M  (LP_AONCLKRST_RST_EN_USB_OTG20_V << LP_AONCLKRST_RST_EN_USB_OTG20_S)
#define LP_AONCLKRST_RST_EN_USB_OTG20_V  0x00000001U
#define LP_AONCLKRST_RST_EN_USB_OTG20_S  2
/** LP_AONCLKRST_RST_EN_USB_OTG11 : R/W; bitpos: [3]; default: 0;
 *  usb org11 reset en
 */
#define LP_AONCLKRST_RST_EN_USB_OTG11    (BIT(3))
#define LP_AONCLKRST_RST_EN_USB_OTG11_M  (LP_AONCLKRST_RST_EN_USB_OTG11_V << LP_AONCLKRST_RST_EN_USB_OTG11_S)
#define LP_AONCLKRST_RST_EN_USB_OTG11_V  0x00000001U
#define LP_AONCLKRST_RST_EN_USB_OTG11_S  3
/** LP_AONCLKRST_RST_EN_USB_DEVICE : R/W; bitpos: [4]; default: 0;
 *  usb device reset en
 */
#define LP_AONCLKRST_RST_EN_USB_DEVICE    (BIT(4))
#define LP_AONCLKRST_RST_EN_USB_DEVICE_M  (LP_AONCLKRST_RST_EN_USB_DEVICE_V << LP_AONCLKRST_RST_EN_USB_DEVICE_S)
#define LP_AONCLKRST_RST_EN_USB_DEVICE_V  0x00000001U
#define LP_AONCLKRST_RST_EN_USB_DEVICE_S  4
/** LP_AONCLKRST_USB_OTG20_PHYREF_CLK_SRC_SEL : R/W; bitpos: [29:28]; default: 0;
 *  usb otg20 hs phy src sel. 2'd0: 12m, 2'd1: 25m, 2'd2: pad_hsphy_refclk.
 */
#define LP_AONCLKRST_USB_OTG20_PHYREF_CLK_SRC_SEL    0x00000003U
#define LP_AONCLKRST_USB_OTG20_PHYREF_CLK_SRC_SEL_M  (LP_AONCLKRST_USB_OTG20_PHYREF_CLK_SRC_SEL_V << LP_AONCLKRST_USB_OTG20_PHYREF_CLK_SRC_SEL_S)
#define LP_AONCLKRST_USB_OTG20_PHYREF_CLK_SRC_SEL_V  0x00000003U
#define LP_AONCLKRST_USB_OTG20_PHYREF_CLK_SRC_SEL_S  28
/** LP_AONCLKRST_USB_OTG20_PHYREF_CLK_EN : R/W; bitpos: [30]; default: 1;
 *  usb otg20 hs phy refclk enable.
 */
#define LP_AONCLKRST_USB_OTG20_PHYREF_CLK_EN    (BIT(30))
#define LP_AONCLKRST_USB_OTG20_PHYREF_CLK_EN_M  (LP_AONCLKRST_USB_OTG20_PHYREF_CLK_EN_V << LP_AONCLKRST_USB_OTG20_PHYREF_CLK_EN_S)
#define LP_AONCLKRST_USB_OTG20_PHYREF_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_USB_OTG20_PHYREF_CLK_EN_S  30
/** LP_AONCLKRST_USB_OTG20_ULPI_CLK_EN : R/W; bitpos: [31]; default: 1;
 *  usb otg20 ulpi clock enable.
 */
#define LP_AONCLKRST_USB_OTG20_ULPI_CLK_EN    (BIT(31))
#define LP_AONCLKRST_USB_OTG20_ULPI_CLK_EN_M  (LP_AONCLKRST_USB_OTG20_ULPI_CLK_EN_V << LP_AONCLKRST_USB_OTG20_ULPI_CLK_EN_S)
#define LP_AONCLKRST_USB_OTG20_ULPI_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_USB_OTG20_ULPI_CLK_EN_S  31

/** LP_AONCLKRST_HP_SDMMC_EMAC_RST_CTRL_REG register
 *  need_des
 */
#define LP_AONCLKRST_HP_SDMMC_EMAC_RST_CTRL_REG (DR_REG_LP_AONCLKRST_BASE + 0x4c)
/** LP_AONCLKRST_RST_EN_SDMMC : R/W; bitpos: [28]; default: 0;
 *  hp sdmmc reset en
 */
#define LP_AONCLKRST_RST_EN_SDMMC    (BIT(28))
#define LP_AONCLKRST_RST_EN_SDMMC_M  (LP_AONCLKRST_RST_EN_SDMMC_V << LP_AONCLKRST_RST_EN_SDMMC_S)
#define LP_AONCLKRST_RST_EN_SDMMC_V  0x00000001U
#define LP_AONCLKRST_RST_EN_SDMMC_S  28
/** LP_AONCLKRST_FORCE_NORST_SDMMC : R/W; bitpos: [29]; default: 0;
 *  hp sdmmc force norst
 */
#define LP_AONCLKRST_FORCE_NORST_SDMMC    (BIT(29))
#define LP_AONCLKRST_FORCE_NORST_SDMMC_M  (LP_AONCLKRST_FORCE_NORST_SDMMC_V << LP_AONCLKRST_FORCE_NORST_SDMMC_S)
#define LP_AONCLKRST_FORCE_NORST_SDMMC_V  0x00000001U
#define LP_AONCLKRST_FORCE_NORST_SDMMC_S  29
/** LP_AONCLKRST_RST_EN_EMAC : R/W; bitpos: [30]; default: 0;
 *  hp emac reset en
 */
#define LP_AONCLKRST_RST_EN_EMAC    (BIT(30))
#define LP_AONCLKRST_RST_EN_EMAC_M  (LP_AONCLKRST_RST_EN_EMAC_V << LP_AONCLKRST_RST_EN_EMAC_S)
#define LP_AONCLKRST_RST_EN_EMAC_V  0x00000001U
#define LP_AONCLKRST_RST_EN_EMAC_S  30
/** LP_AONCLKRST_FORCE_NORST_EMAC : R/W; bitpos: [31]; default: 0;
 *  hp emac force norst
 */
#define LP_AONCLKRST_FORCE_NORST_EMAC    (BIT(31))
#define LP_AONCLKRST_FORCE_NORST_EMAC_M  (LP_AONCLKRST_FORCE_NORST_EMAC_V << LP_AONCLKRST_FORCE_NORST_EMAC_S)
#define LP_AONCLKRST_FORCE_NORST_EMAC_V  0x00000001U
#define LP_AONCLKRST_FORCE_NORST_EMAC_S  31

/** LP_AONCLKRST_DATE_REG register
 *  need_des
 */
#define LP_AONCLKRST_DATE_REG (DR_REG_LP_AONCLKRST_BASE + 0x3fc)
/** LP_AONCLKRST_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_EN    (BIT(31))
#define LP_AONCLKRST_CLK_EN_M  (LP_AONCLKRST_CLK_EN_V << LP_AONCLKRST_CLK_EN_S)
#define LP_AONCLKRST_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
